#include <stdio.h>
#include <stdint.h>
#include "float_arith.h"

//書きなおすのが面倒だったので、レジスタ利用規約を守っていません。
uint32_t fadd(uint32_t a, uint32_t b){
    uint32_t r[16];//, s[16], m[16];
//    int sp;
    r[0] = r[1] = r[2] = 0; //sp = 0;
    r[3] = a; r[4] = b;
    
    r[15] = 1;
    r[14] = 23;
    r[12] = 31;
    r[11] = 9;
    r[1] = r[3];
    r[2] = r[4];
    
    //r[3](4) = abs
    r[3] = r[1] << r[15];
    r[4] = r[2] << r[15];
    
    //絶対値の大きい方をr[1](r[3])とする
    if (r[4] <= r[3]) {} else {
	r[5] = r[1];
	r[1] = r[2];
	r[2] = r[5];
    }
 
    //r[3](4) = exp
    r[5] = 24;
    r[3] = r[1] << r[15];
    r[3] = r[3] >> r[5];
    r[4] = r[2] << r[15];
    r[4] = r[4] >> r[5];
    //r[4] = shift
    r[4] = r[3] - r[4];
    
    //r[5](6) = man
    r[5] = r[1] << r[11];
    r[5] = r[5] >> r[11];
    r[6] = r[2] << r[11];
    r[6] = r[6] >> r[11];
    //r[7] = 0x800000
    r[7] = r[15] << r[14];
    r[5] = r[5] | r[7];
    r[6] = r[6] | r[7];
    //man_b >> shift
    r[6] = r[6] >> r[4];
    
    //r[7](8) = sig
    r[7] = r[1] >> r[12];
    r[8] = r[2] >> r[12];
    //r[9] = man_c
    if (r[7] != r[8]) {
	r[9] = r[5] - r[6];
    } else {
	r[9] = r[5] + r[6];	
    }
    
    r[4] = 25;
    while(1) {
	r[10] = r[15] << r[4];
	r[10] = r[9] & r[10];
	if (r[10] != 0) break;
	r[4] = r[4] - r[15];
	if (r[4] <= 0) break;
    }
    
    if (r[14] <= r[4]) { //繰り上がり
	r[4] = r[4] - r[14];
	r[10] = r[3] + r[4];
	r[9] = r[9] >> r[4];
    } else { //繰り下がり
	r[4] = r[14] - r[4];
	if (r[4] < r[3] /*r[3]<=r[4]*/) {} else {
	    r[3] = 0;
	    return r[3];
	}
	r[10] = r[3] - r[4];
	r[9] = r[9] << r[4];
    }

    r[10] = r[10] << r[14];
    r[9] = r[9] << r[11];
    r[9] = r[9] >> r[11];
    r[1] = r[7] << r[12];
    r[1] = r[1] | r[10];
    r[1] = r[1] | r[9];    
    return r[1];
}

uint32_t fsub(uint32_t a, uint32_t b){
    uint32_t r[16];//, s[16], m[16];
//    int sp;
    r[0] = r[1] = r[2] = 0; //sp = 0;
    r[3] = a; r[4] = b;
    
    r[15] = 1;
    r[14] = 31;
    r[13] = r[15] << r[14];
    r[5] = r[4] >> r[14];;//r[5] = sig(b)
    if (r[5] != 0) {
	r[13] = r[13] - r[15];
	r[4] = r[4] & r[13];
    } else {
	r[4] = r[4] | r[13];
    }
    r[3] = fadd(r[3], r[4]);
    return r[3];
}
